{"type":"data","nodes":[null,{"type":"data","data":[{"enrichedPublication":1},{"id":2,"title":3,"authors":4,"conference":21,"year":22,"category":23,"links":26,"content":30,"abstract":31},"C5","A Low-Latency and Scalable Vector Engine with Operation Fusion for Transformers",[5,11,15,18],{"id":6,"name":7,"img":8,"link":9,"affiliation":10},1,"Mincheol Cha","/imgs/mincheol.jpg","https://chamchiking.github.io/","Seoul National University",{"id":12,"name":13,"img":14,"affiliation":10},2,"Keehyuk Lee","/imgs/person-dummy.jpg",{"id":16,"name":17,"img":14,"affiliation":10},7,"Xuan Truong Nguyen",{"id":19,"name":20,"img":14,"affiliation":10},13,"Hyuk-Jae Lee","IEEE International Conference on Artificial Intelligence Circuits and Systems (AICAS)","2024",[24,25],"FPGA","Transformers",{"pdf":27,"pdf-web":28,"doi":29},"A Low-Latency and Scalable Vector Engine with Operation Fusion for Transformers.pdf","https://ieeexplore.ieee.org/document/10595857","10.1109/AICAS59952.2024.10595857",null,"\u003Cp>Recently, transformer models have been widely deployed for AI services at data centers. However, one of the noticeable deployment challenges is the intensive usage of vector operations such as layer normalization (LayerNorm) and Softmax that generally show sub-optimal performance on general-purpose CPU and GPU due to their low arithmetic intensities and long data dependency. To address the problem, this study presents a low-latency and scalable FPGA-based engine for accelerating vector operations. Specifically, we built a dedicated circuit to effectively execute both element-wise operations and compound fused operations. More importantly, our engine can calculate input mean and variance in parallel, which significantly reduces the instruction count in computing LayerNorm and Softmax. Experimental results show that our design achieves a latency reduction of 50% and 40% for Softmax and LayerNorm, respectively, compared with the SOTA design, while only consuming an additional 20% DSPs, 27% BRAMs, 18% FFs, and 39% LUTs\u003C/p>\n"],"uses":{"params":["id"]}}]}
