{"type":"data","nodes":[null,{"type":"data","data":[{"enrichedPublication":1},{"id":2,"title":3,"authors":4,"conference":35,"year":36,"category":37,"status":40,"note":41,"links":42,"content":44,"abstract":45},"C2","A DVS-CIS Sensor Data Receiver on FPGA with a 10 Gbps MIPI Controller",[5,11,15,18,22,25,28,32],{"id":6,"name":7,"img":8,"link":9,"affiliation":10},1,"Mincheol Cha","/imgs/mincheol.jpg","https://chamchiking.github.io/","Seoul National University",{"id":12,"name":13,"img":14,"affiliation":10},2,"Keehyuk Lee","/imgs/person-dummy.jpg",{"id":16,"name":17,"img":14,"affiliation":10},3,"Bobaro Chang",{"id":19,"name":20,"img":14,"affiliation":21},4,"Soosung Kim","Neuroreality Vision (NRV)",{"id":23,"name":24,"img":14,"affiliation":10},6,"Taeho Lee",{"id":26,"name":27,"img":14,"affiliation":10},7,"Xuan Truong Nguyen",{"id":29,"name":30,"img":14,"affiliation":31},8,"Taesung Kim","Sun Moon University",{"id":33,"name":34,"img":14,"affiliation":21},9,"Hyunsurk Ryu","Proceedings of the IEEE International Symposium on Circuits and Systems (ISCAS)","2025",[38,39],"FPGA","DVS","published","",{"pdf":43},"A DVS-CIS Sensor Data Receiver on FPGA with a 10 Gbps MIPI Controller.pdf",null,"\u003Cp>Fusing a dynamic vision sensor (DVS) and a CMOS image sensor (CIS) is promising in real-time vision applications. However, unlike common CIS, DVS typically come with a custom data format due to their naturally sparse data, which becomes a challenge to fuse DVS and CIS data streams on a generalpurpose CPU. To address this problem, this work proposes a DVS-CIS sensor stream receiver on FPGA. The proposed receiver incorporates a cost-effective address decoder and an inline transpose to receive and store a DVS stream on DRAM effectively. At a system level, a host PC can stream the DVSCIS stream from FPGA via PCIe and display streams on a monitor. Experimental results demonstrate that our architecture can decode up to 13,900fps of DVS frames without incurring any frame drops while concurrently streaming frames at 60fps from a CIS. The design only uses 135 BRAM, 38 DSPs, 69489 LUTs, and 86626 FFs on a Xilinx Zynq+ ZCU106 FPGA board and consumes a power of 6.977 W.\u003C/p>\n"],"uses":{"params":["id"]}}]}
