{"type":"data","nodes":[null,{"type":"data","data":[{"enrichedPublication":1},{"id":2,"title":3,"authors":4,"abstract":38,"conference":39,"year":40,"category":41,"status":45,"note":46,"links":47},"C1","An Energy-Efficient Daily Surveillance System with DVS-CIS Sensor Fusion and Event-based NPU Triggering",[5,11,15,18,22,25,28,31,35],{"id":6,"name":7,"img":8,"link":9,"affiliation":10},1,"Mincheol Cha","/imgs/mincheol.jpg","https://chamchiking.github.io/","Seoul National University",{"id":12,"name":13,"img":14,"affiliation":10},2,"Keehyuk Lee","/imgs/person-dummy.jpg",{"id":16,"name":17,"img":14,"affiliation":10},3,"Bobaro Chang",{"id":19,"name":20,"img":14,"affiliation":21},4,"Soosung Kim","Neuroreality Vision (NRV)",{"id":23,"name":24,"img":14,"affiliation":21},5,"Daniel Moon",{"id":26,"name":27,"img":14,"affiliation":10},6,"Taeho Lee",{"id":29,"name":30,"img":14,"affiliation":10},7,"Xuan Truong Nguyen",{"id":32,"name":33,"img":14,"affiliation":34},8,"Taesung Kim","Sun Moon University",{"id":36,"name":37,"img":14,"affiliation":21},9,"Hyunsurk Ryu","This study presents a daily surveillance system based on dynamic vision sensors (DVS) and CMOS image sensors (CIS) to enable real-time image recognition with low energy consumption. In such a system, a neural processing unit (NPU) - which executes a DNN model to detect objects on a given CIS image - may consume a lot of energy when always-on. To address the problem, this work introduces a system with a DVS-based region of interest (ROI) detector and an event-based NPU trigger for energy savings. Based on DVS, the ROI detector effectively recognizes scene changes in dynamic environments, e.g., low-light scenes at midnight, which serves as a trigger to invoke the NPU for object detection. Our system prototype was built on a host PC and two Xilinx Zynq+ ZCU106 FPGA boards, one for the DVS-CIS receiver and the other for our NPU. The experimental results demonstrated that Over a 24-hour testing period, our system achieved a 31.5% reduction in energy usage. Operating a YOLOv3-Tiny object detector at 200 MHz, our NPU achieves a latency of just 18 ms, enabling seamless real-time monitoring capabilities","Proceedings of the IEEE International Symposium on Circuits and Systems (ISCAS)","2025",[42,43,44],"FPGA","DVS","NPU","published","",{"pdf":48},"An Energy-Efficient Daily Surveillance System with DVS-CIS Sensor Fusion and Event-based NPU Triggering.pdf"],"uses":{"params":["id"]}}]}
